{ "format": "layers-model", "generatedBy": "keras v2.7.0", "convertedBy": "TensorFlow.js Converter v3.12.0", "modelTopology": { "keras_version": "2.7.0", "backend": "tensorflow", "model_config": { "class_name": "Model", "config": { "name": "model", "layers": [{ "class_name": "InputLayer", "config": { "batch_input_shape": [null, 784], "dtype": "float32", "sparse": false, "ragged": false, "name": "digits" }, "name": "digits", "inbound_nodes": [] }, { "class_name": "Dense", "config": { "name": "layer0", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": { "class_name": "GlorotUniform", "config": { "seed": null } }, "bias_initializer": { "class_name": "Zeros", "config": {} }, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null }, "name": "layer0", "inbound_nodes": [
                        [
                            ["digits", 0, 0, {}]
                        ]
                    ] }, { "class_name": "Dense", "config": { "name": "layer1", "trainable": true, "dtype": "float32", "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": { "class_name": "GlorotUniform", "config": { "seed": null } }, "bias_initializer": { "class_name": "Zeros", "config": {} }, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null }, "name": "layer1", "inbound_nodes": [
                        [
                            ["layer0", 0, 0, {}]
                        ]
                    ] }, { "class_name": "Dense", "config": { "name": "layer2", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": { "class_name": "GlorotUniform", "config": { "seed": null } }, "bias_initializer": { "class_name": "Zeros", "config": {} }, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null }, "name": "layer2", "inbound_nodes": [
                        [
                            ["layer1", 0, 0, {}]
                        ]
                    ] }, { "class_name": "Dense", "config": { "name": "layer3", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": { "class_name": "GlorotUniform", "config": { "seed": null } }, "bias_initializer": { "class_name": "Zeros", "config": {} }, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null }, "name": "layer3", "inbound_nodes": [
                        [
                            ["layer2", 0, 0, {}]
                        ]
                    ] }, { "class_name": "Dense", "config": { "name": "layer4", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": { "class_name": "GlorotUniform", "config": { "seed": null } }, "bias_initializer": { "class_name": "Zeros", "config": {} }, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null }, "name": "layer4", "inbound_nodes": [
                        [
                            ["layer3", 0, 0, {}]
                        ]
                    ] }, { "class_name": "Dense", "config": { "name": "predictions", "trainable": true, "dtype": "float32", "units": 10, "activation": "linear", "use_bias": true, "kernel_initializer": { "class_name": "GlorotUniform", "config": { "seed": null } }, "bias_initializer": { "class_name": "Zeros", "config": {} }, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null }, "name": "predictions", "inbound_nodes": [
                        [
                            ["layer4", 0, 0, {}]
                        ]
                    ] }], "input_layers": [
                    ["digits", 0, 0]
                ], "output_layers": [
                    ["predictions", 0, 0]
                ] } } }, "weightsManifest": [{ "paths": ["group1-shard1of1.bin"], "weights": [{ "name": "layer0/kernel", "shape": [784, 512], "dtype": "float32" }, { "name": "layer0/bias", "shape": [512], "dtype": "float32" }, { "name": "layer1/kernel", "shape": [512, 256], "dtype": "float32" }, { "name": "layer1/bias", "shape": [256], "dtype": "float32" }, { "name": "layer2/kernel", "shape": [256, 128], "dtype": "float32" }, { "name": "layer2/bias", "shape": [128], "dtype": "float32" }, { "name": "layer3/kernel", "shape": [128, 64], "dtype": "float32" }, { "name": "layer3/bias", "shape": [64], "dtype": "float32" }, { "name": "layer4/kernel", "shape": [64, 32], "dtype": "float32" }, { "name": "layer4/bias", "shape": [32], "dtype": "float32" }, { "name": "predictions/kernel", "shape": [32, 10], "dtype": "float32" }, { "name": "predictions/bias", "shape": [10], "dtype": "float32" }] }] }